NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/EFR32MG21A020F512IM32.svd
        <register>
          <name>EXTIPSELL</name>
          <description>External Interrupt Port Select Low</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x33333333</resetMask>
          <fields>
            <field>
              <name>EXTIPSEL0</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL1</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL2</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL3</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL4</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL5</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL6</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL7</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIPINSELL</name>
          <description>External Interrupt Pin Select Low</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x33333333</resetMask>
          <fields>
            <field>
              <name>EXTIPINSEL0</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL1</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL2</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL3</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL4</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL5</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL6</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPINSEL7</name>
              <description>External Interrupt Pin select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET0</name>
                  <description>OFFSET=0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET1</name>
                  <description>OFFSET=1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET2</name>
                  <description>OFFSET=2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET3</name>
                  <description>OFFSET=3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIRISE</name>
          <description>External Interrupt Rising Edge Trigger</description>
          <addressOffset>0x410</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>EXTIRISE</name>
              <description>EXT Int Rise</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIFALL</name>
          <description>External Interrupt Falling Edge Trigger</description>
          <addressOffset>0x414</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>EXTIFALL</name>
              <description>EXT Int FALL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>Interrupt Flag</description>
          <addressOffset>0x420</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXT</name>
              <description>External Pin Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM4WU</name>
              <description>EM4 wake up</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x424</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTIEN</name>
              <description>External Pin Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM4WUIEN</name>
              <description>EM4 Wake Up Interrupt En</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EM4WUEN</name>
          <description>No Description</description>
          <addressOffset>0x42C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0000</resetMask>
          <fields>
            <field>
              <name>EM4WUEN</name>
              <description>EM4 wake up enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EM4WUPOL</name>
          <description>No Description</description>
          <addressOffset>0x430</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFF0000</resetMask>
          <fields>
            <field>
              <name>EM4WUPOL</name>
              <description>EM4 Wake-Up Polarity</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
